Repository: 47first/47first.github.io
Catalog: 47FirstGitHubPage.Blazor/Resources/HomePageLocalization.*.resx
Languages: ru

source: Anton Derevnin
ru: Антон Деревнин

source: Unity Developer
ru: Unity Разработчик

source: Languages
ru: Языки

# EnglishSkill
source: English - B1
ru: Английский - B1

# RussiaSkill
source: Russia - C2
ru: Русский - C2

source: Links
ru: Ссылки

source: Common Skills
ru: Общие навыки

source: Unity Skills
ru: Unity навыки

source: Web Skills
ru: Web навыки

source: About Me
ru: Обо Мне

# About Me Text
source: I have been developing with Unity for {1} and with C# for {0}. During this time, I gained 1 year of experience working within a team (Office Sleeper, <a target="_blank" href="https://www.youtube.com/watch?v=KfFTYtgETJw&feature=youtu.be&ab_channel=YevhenKozlov">progress as of February 2023</a>). Later, I joined an outsourcing company as a .NET Developer, where I am currently working ({2}). In my free time, I develop my own games independently. Examples of my work are provided below in the portfolio section.
ru: Разработкой на Unity занимаюсь {1}, на C# - {0}. За это время успел поработать в команде на протяжении 1 года (Office Sleeper, <a target="_blank" href="https://www.youtube.com/watch?v=KfFTYtgETJw&feature=youtu.be&ab_channel=YevhenKozlov">прогресс на февраль 2023</a>), позже устроился в аутсорс компанию .NET разработчиком, где работаю по текущее время ({2}). В свободное от работы время занимаюсь разработкой своих игр в одиночку. Примеры моих работ расположены ниже в секции с портфолио.

source: Portfolio below
ru: Портфолио ниже

# BallmenDescription
source: Ballmen is a multiplayer/single-player 2D fighting platformer. The main goal is to score more points for your team before the timer runs out. You can achieve this by kicking opponents into their own team's basket or eliminating all lives of the opposing team. The game supports PC and Android platforms
ru: Ballmen - это мультиплеерный/одиночный 2д файтинг-платформер. Главная цель игры - набрать больше очков для своей команды, до того как закончится таймер. Сделать это можно закинув вражеского игрока в корзину его команды или потратив все жизни участников вражеской команды. Игра имеет поддержку ПК и Andoid платформ.

# CutCutDescription
source: CutCut - Casual game where you need to survive as long as possible without spending all your lives, while simultaneously sawing the box to count the score.
ru: CutCut - Казуальная игра, в которой необходимо продержаться как можно дольше дольше времени не потратив всех жизней, параллельно распиливая коробки, чтобы увеличивать счет.

# AirSmithDescription
source: Air Smith - WebGL game with local multiplayer for 2 players. The goal is gain more score than oponent player by destroying his space ship.
ru: Air Smith - WebGL игра с локальным мультиплеером на 2 игроков. Цель игры - получить больше очков чем у опонента, уничтожая его космический корабль.
